module.exports = text = {
  help: "Помощь по боту:\n/command все функции бота\n/start перезапуск бота\n/shop магазин\n\nТакже если вы нашли ошибку пишите @ralf303",
  sub: "📝 Для сбора мефа нужно быть подписанным на канал @mef_dev",
  pups_err: "Я не смог отправить тебе секретную инфу так как ты меня заблокал",
  shop_err: "Я не смог открыть магазин так как ты меня заблокал",
  add_err:
    "Ты уже принял участие в раздаче!\n\n❗️Не отписывайся от канала и ожидай награды❗️",
  add_start:
    "Ты успешно принял участие, в течении трех дней ты получишь совю награду!\n\n❗️ОТ КАНАЛА ОТПИСЫВАТЬСЯ НЕЛЬЗЯ, ИНАЧЕ НАГРАДЫ НЕ БУДЕТ❗️",
  pups: "❗️ПУПСЫ❗️\n\n•Пупс «Удача»\nС этой штукой вам подозрительно будет везти\n\n•Пупс «Красноречие»\nВаше общение будет оплачиваться в два раза выше!\n\n•Пупс «Харизма»\nПользуясь своей харизмой, вы профессионально созываете всех в чат и получаете большую награду\n\n•Пупс «Интелект»\nС ним вы будете казаться умнее, а еще все знают какой вы богатый)\n\n•Пупс «Наука»\nИспользуй команду синтез для конвертации гемов в меф\n\n•Пупс «Бартер»\nПри продаже вещей вы получаете полную ее стоимость, а не 50%\n\n•Пупс «Ремонт»\nУвеличивает максимальный доход с дрона майнера до 150к\n\n\nУдачи в поисках)",
};
