module.exports = text = {
  help: "Помощь по боту:\n/commands все функции бота\n/start перезапуск бота\n/shop магазин\n\nТакже если ты нашли ошибку пишите @ralf303",
  sub: "📝 Для сбора мефа нужно быть подписанным на канал @mef_dev",
  pups_err: "Я не смог отправить тебе секретную инфу так как ты меня заблокал",
  shop_err: "Я не смог открыть магазин так как ты меня заблокал",
  family:
    "Семья это главое!\n\nСобирайте репутацию, получайте монеты, улучшайте акссесуары и становитесь топ 1 семьей!\nБольше информации =>",
  add_err:
    "Ты уже принял участие в раздаче!\n\n❗️Не отписывайся от канала и ожидай награды❗️",
  add_no_sub:
    "Ты не подписался на нужный канал!\n\n❗️Внимательно перечитай условия раздачи❗️",
  add_start:
    "Ты успешно принял участие, в течении трех дней ты получишь свою награду!\n\n❗️ОТ КАНАЛА ОТПИСЫВАТЬСЯ НЕЛЬЗЯ, ИНАЧЕ НАГРАДЫ НЕ БУДЕТ❗️",
  pups: "❗️ПУПСЫ❗️\n\n•Пупс «Удача»\nС этой штукой вам подозрительно будет везти\n\n•Пупс «Красноречие»\nНаграда за общение будет в два раза больше!\n\n•Пупс «Харизма»\nНаграда за приглашение в чат нотых юзеров будет больше>\n\n•Пупс «Интелект»\nС ним ты будете казаться умнее)\n\n•Пупс «Наука»\nИспользуй команду синтез для конвертации гемов в меф\n\n•Пупс «Бартер»\nПри продаже вещей ты получаете полную ее стоимость, а не 50%\n\n•Пупс «Ремонт»\nУвеличивает максимальный доход с дрона майнера до 200к\n\n\nУдачи в поисках)",
  commands: "https://telegra.ph/Rukovodstvo-po-botu-06-16",
  not_owner: "Ты не владелец этой беседы",
  no_active_without_vip:
    "Сбор статистики актива и награда за него доступна только в випчатах\n\n📖Випчат\n📖Купить випчат",
  no_games_in_chat:
    "Владелец беседы ограничил этот модуль, бандит и куб доступен либо в лс либо в @mefanarhia\n\n📖+игры",
  wrong_dice:
    'Введи ставку, а дальше число от 1 до 6, "чет" или "нечет", например "куб 1000 5" или "куб 500 нечет"',
  no_case_in_chat:
    "Владелец беседы ограничил этот модуль, мефкейсы доступны либо в лс либо в @mefanarhia\n\n📖+кейсы",
  mef_upgrade:
    "💎Улучшение сбора💎\n\n1 лвл: 50-100 мефа за сбор\n2 лвл: 100-200 мефа за сбор\n3 лвл: 200-400 мефа за сбор\n4 лвл: 300-500 мефа за сбор\n\n💰Каждое улучшение стоит 20к💰",
  time_upgrade:
    "🕘Улучшение времени🕘\n\nС каждым уровнем уменьшается количество времени между сбором\nНа первом уровне интервал сбора 4 часа. Всего уровней 4 и каждый сбрасывает время на один час.\n\n💰Цена одного улучшения 10к💰",
  inventory_upgrade:
    "🎒Улучшение инвентаря🎒\n\nВсе просто, чем больше слотов тем больше вещей ты можешь хранить\n\n💰1 слот стоит 5к💰",
  buy_vip_chat:
    "💎 Ты собираешься продлить випчат на 30 дней\n\n🌿 Цена: 1.000.000 мефа",
  buy_fam: "💎 Ты собираешься создать семью.\n\n🌿 Цена: 5.000.000 мефа",
  buy_check:
    "✅ Ты собираешься купить галочку для своей семьи.\n\n🌿 Цена: 10.000.000 мефа",
  about_vip_chat:
    '💎 Каждый чат может себе купить вип статус который добавит полезные функции.\n\n•Капча в случайное время\n•Сбор статистики и награда за нее\n\nКупить випчат на 30 дней можно командой "Купить випчат"',
};
