const rp = {
  кинуть: { value: "кинул(а) напрогиб", emoji: "🫂" },
  доза: { value: "вколол(а) дозу", emoji: "💉" },
  секс: { value: "трахнул(а) и кончил(а) внутрь", emoji: "🔞" },
  уничтожить: { value: "уничтожил(а)", emoji: "💀" },
  нюхать: { value: "занюхнул(а) мефа вместе с", emoji: "🌿" },
  накормить: { value: "вкусно накормил(а)", emoji: "👨‍🍳" },
  отшлепать: { value: "смачно отшлепал(а)", emoji: "🔞" },
  бум: { value: "взорвал(а)", emoji: "💥" },
  кончить: { value: "кончил(а) на лицо", emoji: "💦" },
  вылечить: { value: "сделал(а) укол в попу и вылечил(а)", emoji: "💉" },
};

module.exports = rp;
